app/controllers/articles_controller.rb

  def update
    @article = Article.find(params[:id])
  #  byebug
    if @article.update(article_params)
---
SELECT  `articles`.* FROM `articles` WHERE `articles`.`id` = 11 LIMIT 1
UPDATE `articles` SET `title` = 'Osthee mame', `updated_at` = '2023-09-26 00:46:29' WHERE `articles`.`id` = 11